In [ ]:
import numpy as np
import pandas as pd

nomi = ["alice","bob","carlo","daniele","ernesto","francesco"]
città = ["napoli", "roma", "milano", "torino", "firenze", "palermo"]

data = []

for i in range(len(nomi)):

    data.append([np.random.choice(nomi),np.random.randint(18,60),np.random.choice(città),np.random.randint(1000, 3000)])

df = pd.DataFrame(data)

df

           0   1        2     3
0  francesco  31   napoli  2427
1        bob  52  firenze  2166
2      carlo  46  firenze  1526
3      carlo  31     roma  1630
4      carlo  22   torino  1164
5      carlo  47   napoli  2771

In [9]:
import numpy as np
import pandas as pd

prodotti = ["pane","olio","pasta","banane","mele","formaggio"]
città = ["napoli", "roma", "milano", "torino", "firenze", "palermo"]

data = []

for i in range(len(nomi)):

    data.append([np.random.choice(prodotti),np.random.randint(10000,50000),np.random.randint(1,4),np.random.choice(città)])

df = pd.DataFrame(data, columns = ["Prodotto", "Quantità","Prezzo Unitario","Città"])

df

  Prodotto  Quantità  Prezzo Unitario    Città
0   banane     26197                1  firenze
1     pane     17462                2  palermo
2     mele     24291                2  firenze
3     olio     26364                3   milano
4     olio     30162                2  palermo
5     pane     49669                1  palermo

In [11]:
df["Totale Vendite"] = df["Quantità"]*df["Prezzo Unitario"]

df

  Prodotto  Quantità  Prezzo Unitario    Città  Totale Vendite
0   banane     26197                1  firenze           26197
1     pane     17462                2  palermo           34924
2     mele     24291                2  firenze           48582
3     olio     26364                3   milano           79092
4     olio     30162                2  palermo           60324
5     pane     49669                1  palermo           49669

In [45]:
df.groupby("Prodotto")["Totale Vendite"].sum()

Prodotto
banane     26197
mele       48582
olio      139416
pane       84593
Name: Totale Vendite, dtype: int64

In [19]:
df.idxmax()

massimo_quantità = df["Quantità"].max()

massimo_quantità

np.int64(49669)

In [34]:
df1 = df[df["Totale Vendite"] > 30000]

print(df1)

  Prodotto  Quantità  Prezzo Unitario    Città  Totale Vendite
1     pane     17462                2  palermo           34924
2     mele     24291                2  firenze           48582
3     olio     26364                3   milano           79092
4     olio     30162                2  palermo           60324
5     pane     49669                1  palermo           49669

In [36]:
df_ordinato = df.sort_values(by='Totale Vendite', ascending=False)

print(df_ordinato)

  Prodotto  Quantità  Prezzo Unitario    Città  Totale Vendite
3     olio     26364                3   milano           79092
4     olio     30162                2  palermo           60324
5     pane     49669                1  palermo           49669
2     mele     24291                2  firenze           48582
1     pane     17462                2  palermo           34924
0   banane     26197                1  firenze           26197

In [37]:
vendite_per_città = df.groupby('Città')['Totale Vendite'].sum()

vendite_per_città

Città
firenze     74779
milano      79092
palermo    144917
Name: Totale Vendite, dtype: int64

In [38]:
città_max = vendite_per_città.idxmax()
vendite_max = vendite_per_città.max()

print(città_max)
print("------")
print(vendite_max)

palermo
------
144917